
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13347325581)


<pre><code>Plan: 15 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.prod__k8s_nodes.null_resource.gateway_provision_ip_routing
  * module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__gateway
  * module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__pve
  * module.prod__k8s_nodes.null_resource.vm_ci_config__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.null_resource.vm_ci_config__gateway
  * module.prod__k8s_nodes.null_resource.vm_ci_config__worker[&#34;1&#34;]
  * module.prod__k8s_nodes.proxmox_vm_qemu.control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.proxmox_vm_qemu.gateway
  * module.prod__k8s_nodes.proxmox_vm_qemu.worker[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_root_password__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_root_password__gateway
  * module.prod__k8s_nodes.random_password.vm_root_password__worker[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_user_password__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.random_password.vm_user_password__gateway
  * module.prod__k8s_nodes.random_password.vm_user_password__worker[&#34;1&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prod__k8s_nodes.null_resource.gateway_provision_ip_routing will be created
  + resource "null_resource" "gateway_provision_ip_routing" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__gateway will be created
  + resource "null_resource" "gateway_provision_ssh_private_key__gateway" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.gateway_provision_ssh_private_key__pve will be created
  + resource "null_resource" "gateway_provision_ssh_private_key__pve" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.vm_ci_config__control_plane["1"] will be created
  + resource "null_resource" "vm_ci_config__control_plane" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.vm_ci_config__gateway will be created
  + resource "null_resource" "vm_ci_config__gateway" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.vm_ci_config__worker["1"] will be created
  + resource "null_resource" "vm_ci_config__worker" {
      + id = (known after apply)
    }

  # module.prod__k8s_nodes.proxmox_vm_qemu.control_plane["1"] will be created
  + resource "proxmox_vm_qemu" "control_plane" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__cp-01.yaml"
      + ciupgrade              = false
      + clone                  = "rhel-9.4"
      + clone_wait             = 10
      + cores                  = 3
      + cpu_type               = "x86-64-v3"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.8.11/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 3072
      + name                   = "prod-k8s-cp-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;control_plane"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 811

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prod__k8s_nodes.proxmox_vm_qemu.gateway will be created
  + resource "proxmox_vm_qemu" "gateway" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__gateway.yaml"
      + ciupgrade              = false
      + clone                  = "rhel-9.4"
      + clone_wait             = 10
      + cores                  = 2
      + cpu_type               = "x86-64-v3"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.20.5/24,gw=192.168.20.1"
      + ipconfig1              = "ip=192.168.8.1/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "prod-k8s-gw-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;gateway"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 801

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prod__k8s_nodes.proxmox_vm_qemu.worker["1"] will be created
  + resource "proxmox_vm_qemu" "worker" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__wk-01.yaml"
      + ciupgrade              = false
      + clone                  = "rhel-9.4"
      + clone_wait             = 10
      + cores                  = 3
      + cpu_type               = "x86-64-v3"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.8.21/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 6144
      + name                   = "prod-k8s-wk-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;worker"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 821

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prod__k8s_nodes.random_password.vm_root_password__control_plane["1"] will be created
  + resource "random_password" "vm_root_password__control_plane" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_root_password__gateway will be created
  + resource "random_password" "vm_root_password__gateway" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_root_password__worker["1"] will be created
  + resource "random_password" "vm_root_password__worker" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_user_password__control_plane["1"] will be created
  + resource "random_password" "vm_user_password__control_plane" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_user_password__gateway will be created
  + resource "random_password" "vm_user_password__gateway" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.prod__k8s_nodes.random_password.vm_user_password__worker["1"] will be created
  + resource "random_password" "vm_user_password__worker" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + prod__k8s_control_plane_nodes = [
      + {
          + ip0     = (known after apply)
          + vm_name = "prod-k8s-cp-01"
        },
    ]
  ~ prod__k8s_gateway_node        = {
      ~ ip0     = "192.168.20.5" -> (known after apply)
        # (1 unchanged attribute hidden)
    }
  + prod__k8s_worker_nodes        = [
      + {
          + ip0     = (known after apply)
          + vm_name = "prod-k8s-wk-01"
        },
    ]
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":84,"Program":"tfcmt","SHA1":"2b9d4a34c45b36f1d1d9363f04bb1f0b2a59c28d","Vars":{},"WorkflowName":"Terraform CI"} -->